use mermaid for readme diagrams
